"""
This module consist string constants with bot answers. 
"""


START = (
    'Привіт, це бот для перегляду розкладу.\n'
    'Для вибору або зміни групи напиши /gr [name]\n'
    'Наприклад: /gr ВІТ-31'
)

HELP = (
    'Неофіційний бот для перегляду розкладу в НУВГП.\n'
    'На рахунок багів, фіч і пропозицій пишіть в телеграм @jetraid.\n'
    '\n'
    'Список доступних команд:\n'
    '/gr - змінити або переглянути поточну групу\n'
    '/today - розклад на сьогодні\n'
    '/tomorrow - розклад на завтра\n'
    '/week - розклад на тиждень\n'
    '/nextweek - розклад на наступний тиждень\n'
    '/teachers - список твоїх викладачів\n'
    '/timetable - розклад дзвінків\n'
    '/help - допомога'
)

NO_LESSONS_TODAY = 'Сьогодні в тебе немає пар)'
NO_LESSONS_TOMORROW = 'На щастя завтра в тебе немає пар.'
NO_LESSONS_WEEK = 'Цього тижня ти відпочиваєш.'
NO_LESSONS_NEXT_WEEK = 'Наступного тижня ти вільний. Вітаю!'

NO_SCHEDULE = 'Схоже для твоєї групи ще немає розкладу.'

SELECTED_GROUP = (
    'Ти знаходишся в групі {}.\n\n'
    'Для зміни групи напиши /gr [name]\n'
    'Наприклад: /gr ВІТ-31'
)
SAME_GROUP = 'Ти вже знаходишся в групі {}.'
SET_GROUP = 'Група {} успішно обрана.'
CHANGE_GROUP = 'Група успішно змінена на {}.'
WRONG_GROUP = 'Групи з такою назвою не існує.'
SUGGEST_GROUP = 'Спробуй одну із цих:\n• {}'
SELECT_GROUP = (
    'Спочатку обери групу за допомогою команди /gr [name]\n'
    'Наприклад: /gr ВІТ-31'
)

TIMETABLE = (
    '_Розклад дзвінків_\n'
    '1) `08:00 - 09:20`\n'
    '2) `09:40 - 11:00`\n'
    '3) `11:15 - 12:35`\n'
    '4) `13:00 - 14:20`\n'
    '5) `14:35 - 15:55`'
    )

API_SERVER_ERROR = (
    'Схоже сервер розкладу зараз недоступний(\n'
    'Будь ласка спробуй пізніше.'
)